<template>
    <div class="privacy-policy">
      <div class="header">
        <h1>Політика конфіденційності</h1>
        <p>Останнє оновлення: 26 травня 2024 року</p>
      </div>
      
      <section>
        <h2>Вступ</h2>
        <p>Ласкаво просимо до Game Treasure. Ми зобов'язані захищати вашу особисту інформацію та ваше право на конфіденційність. Якщо у вас є будь-які питання або занепокоєння щодо нашої політики або наших практик щодо вашої особистої інформації, будь ласка, зв'яжіться з нами за адресою <a href="mailto:support@gametreasure.com">support@gametreasure.com</a>.</p>
      </section>
  
      <section>
        <h2>Інформація, яку ми збираємо</h2>
        <p>Ми збираємо особисту інформацію, яку ви добровільно надаєте нам, коли реєструєтеся на Веб-сайті, виявляєте інтерес до отримання інформації про нас або наші продукти та послуги, коли берете участь у діяльності на Веб-сайті або іншим чином зв'язуєтесь з нами.</p>
        <ul>
          <li>Особиста інформація: ім'я, адреса електронної пошти, тощо.</li>
          <li>Дані про використання: IP-адреса, тип браузера, операційна система тощо.</li>
        </ul>
      </section>
  
      <section>
        <h2>Як ми використовуємо вашу інформацію</h2>
        <p>Ми використовуємо інформацію, яку ми збираємо або отримуємо:</p>
        <ul>
          <li>Для полегшення створення облікового запису та процесу входу.</li>
          <li>Для надсилання адміністративної інформації вам.</li>
          <li>Для виконання та управління вашими замовленнями.</li>
          <li>Для управління обліковими записами користувачів.</li>
          <li>Для відповіді на запити користувачів та надання підтримки клієнтам.</li>
        </ul>
      </section>
  
      <section>
        <h2>Розкриття вашої інформації</h2>
        <p>Ми розкриваємо інформацію тільки за вашою згодою, для дотримання законів, для надання вам послуг, для захисту ваших прав або для виконання бізнес-зобов'язань.</p>
        <ul>
          <li>Бізнес-передачі: Ми можемо передавати або обмінюватися вашою інформацією в зв'язку з, або під час переговорів про будь-яке злиття, продаж активів компанії, фінансування або придбання всього або частини нашого бізнесу іншій компанії.</li>
          <li>Афілійовані особи: Ми можемо ділитися вашою інформацією з нашими афілійованими особами, у цьому випадку ми вимагатимемо від цих афілійованих осіб дотримуватися цієї політики конфіденційності.</li>
        </ul>
      </section>
  
      <section>
        <h2>Ваші права на конфіденційність</h2>
        <p>У деяких регіонах ви маєте певні права відповідно до чинних законів про захист даних. Це може включати право на:</p>
        <ul>
          <li>Запит на доступ та отримання копії вашої особистої інформації.</li>
          <li>Запит на виправлення або видалення вашої особистої інформації.</li>
          <li>Обмеження обробки вашої особистої інформації.</li>
          <li>Якщо це застосовно, на перенесення даних.</li>
        </ul>
      </section>
  
      <section>
        <h2>Зв'яжіться з нами</h2>
        <p>Якщо у вас є питання або коментарі щодо цієї політики, ви можете написати нам на адресу <a href="mailto:support@gametreasure.com">support@gametreasure.com</a>.</p>
      </section>
    </div>
  </template>
  
  <script>
  export default {
    name: 'PrivacyPolicy'
  }
  </script>
  
  <style scoped>
  .privacy-policy {
    padding: 20px;
    max-width: 800px;
    margin: 0 auto;
    font-family: 'Roboto', sans-serif;
    line-height: 1.6;
    color: #444;
    background-color: #f9f9f9;
    border-radius: 8px;
    box-shadow: 0 4px 8px rgba(0, 0, 0, 0.1);
  }
  
  .privacy-policy .header {
    text-align: center;
    margin-bottom: 20px;
  }
  
  .privacy-policy h1 {
    font-size: 2.5em;
    color: #222;
  }
  
  .privacy-policy h2 {
    font-size: 1.75em;
    color: #333;
    margin-top: 1.5em;
  }
  
  .privacy-policy p {
    margin: 1em 0;
  }
  
  .privacy-policy a {
    color: #007BFF;
    text-decoration: none;
  }
  
  .privacy-policy a:hover {
    text-decoration: underline;
  }
  
  .privacy-policy ul {
    list-style-type: disc;
    margin-left: 20px;
  }
  
  .privacy-policy ul li {
    margin-bottom: 10px;
  }
  </style>
  